app/Models/ContaModel.php

    public function getDataC($username = null){
        if ($username == null){

            return $this->findAll();
        }


        return $this->asArray()->where(['username' => $username, 'tipo' => "Corrente"])->first();
---
SELECT *
FROM `conta`
WHERE `username` = 'jojo'
AND `tipo` = 'Corrente'
 LIMIT 1

        public function getDataP($username = null){
        if ($username == null){

            return $this->findAll();
        }


        return $this->asArray()->where(['username' => $username, 'tipo' => "Poupança"])->first();
---
SELECT *
FROM `conta`
WHERE `username` = 'jojo'
AND `tipo` = 'Poupança'
 LIMIT 1