app/Models/ExtratoModel.php

    public function getTotalC($username = null){
    //   if ($username == null){

    //       return $this->findAll();
    //   }

        $this->select('id, sum(extrato.valor) as total, extrato.tipo, conta, conta.numero as numero, tipopagamento, descricao, data');
        $this->join('conta', 'conta.numero = extrato.conta', 'left');
        $this->groupBy('conta.numero'); // Produces: GROUP BY title

      return $this->asArray()->where(['conta.username' => $username, 'conta.tipo' => "Corrente"])->first();
---
SELECT `id`, sum(extrato.valor) as total, `extrato`.`tipo`, `conta`, `conta`.`numero` as `numero`, `tipopagamento`, `descricao`, `data`
FROM `extrato`
LEFT JOIN `conta` ON `conta`.`numero` = `extrato`.`conta`
WHERE `conta`.`username` = 'jojo'
AND `conta`.`tipo` = 'Corrente'
GROUP BY `conta`.`numero`
ORDER BY `extrato`.`id` ASC
 LIMIT 1

      public function getTotalP($username = null){
    //   if ($username == null){

    //       return $this->findAll();
    //   }

        $this->select('id, sum(extrato.valor) as total, extrato.tipo, conta, conta.numero as numero, tipopagamento, descricao, data');
        $this->join('conta', 'conta.numero = extrato.conta', 'left');
        $this->groupBy('conta.numero'); // Produces: GROUP BY title

      return $this->asArray()->where(['conta.username' => $username, 'conta.tipo' => "Poupança"])->first();
---
SELECT `id`, sum(extrato.valor) as total, `extrato`.`tipo`, `conta`, `conta`.`numero` as `numero`, `tipopagamento`, `descricao`, `data`
FROM `extrato`
LEFT JOIN `conta` ON `conta`.`numero` = `extrato`.`conta`
WHERE `conta`.`username` = 'jojo'
AND `conta`.`tipo` = 'Poupança'
GROUP BY `conta`.`numero`
ORDER BY `extrato`.`id` ASC
 LIMIT 1