app/Models/ProductsModel.php

SELECT *, `produtos`.`nome` as `nome`, `produtos`.`id` as `id`, `categorias`.`nome` as `nomec`
FROM `produtos`
LEFT JOIN `categorias` ON `produtos`.`categoria` = `categorias`.`id`
WHERE `produtos`.`nome` LIKE '%re%' ESCAPE '!'
---
    public function getData2($string = null){

        if ($string == null){
              $this->select('*, produtos.nome as nome, produtos.id as id, categorias.nome as nomec');
            $this->join('categorias', 'produtos.categoria = categorias.id', 'left');
            return $this->findAll();
        }
          $this->select('*, produtos.nome as nome, produtos.id as id, categorias.nome as nomec');
            $this->join('categorias', 'produtos.categoria = categorias.id', 'left');
        return $this->asArray()->like('produtos.nome', $string)->findAll();

SELECT *, `produtos`.`nome` as `nome`, `produtos`.`id` as `id`, `categorias`.`nome` as `nomec`
FROM `produtos`
LEFT JOIN `categorias` ON `produtos`.`categoria` = `categorias`.`id`
WHERE `categorias`.`id` = '3'
---
    public function getCategory($id = null){

        if ($id == 0){
              $this->select('*, produtos.nome as nome, produtos.id as id, categorias.nome as nomec');
            $this->join('categorias', 'produtos.categoria = categorias.id', 'left');
            return $this->findAll();
        }
          $this->select('*, produtos.nome as nome, produtos.id as id, categorias.nome as nomec');
            $this->join('categorias', 'produtos.categoria = categorias.id', 'left');
        return $this->asArray()->where('categorias.id', $id)->findAll();